InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта/Ext/ManagerModule.bsl
Процедура ИзменитьДанныеКомплекта(стПараметры) Экспорт
	
	ТД = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Комплект.Установить(стПараметры.Комплект);
	НаборЗаписей.Отбор.Период.Установить(ТД);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
		
	Запрос.УстановитьПараметр("Комплект", стПараметры.Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
	НужнаЗапись = Ложь;
	
	Если стПараметры.Свойство("Конструктор") Тогда
		Если НЕ НоваяЗапись.Конструктор = стПараметры.Конструктор Тогда
			
			СтруктуруДляИзмененияИсполнителя = омЗадачаОбщаяНаСервере.ПолучитьСтруктуруДляИзмененияИсполнителя(стПараметры.Конструктор, , Истина);
			омЗадачаОбщаяНаСервере.ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзмененияИсполнителя, стПараметры.Комплект); 
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
		НоваяЗапись.Конструктор = стПараметры.Конструктор; 
	КонецЕсли;
	
	Если стПараметры.Свойство("Приоритет") Тогда
		Если НЕ НоваяЗапись.Приоритет = стПараметры.Конструктор Тогда

			НоваяЗапись.Приоритет	= стПараметры.Приоритет;
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если стПараметры.Свойство("ТекущаяСтадия") Тогда
		Если НЕ НоваяЗапись.ТекущаяСтадия = стПараметры.ТекущаяСтадия Тогда

			НоваяЗапись.ТекущаяСтадия	= стПараметры.ТекущаяСтадия;
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если стПараметры.Свойство("ВнешняяПродолжительностьПроизводства") Тогда
		Если НЕ НоваяЗапись.ВнешняяПродолжительностьПроизводства = стПараметры.ВнешняяПродолжительностьПроизводства Тогда

			НоваяЗапись.ВнешняяПродолжительностьПроизводства	= стПараметры.ВнешняяПродолжительностьПроизводства;
			
			Если НоваяЗапись.ВнешняяПродолжительностьПроизводства > 0 И НоваяЗапись.ВнешняяДатаНачалоПроизводства > Дата(1, 1, 1) Тогда
				
				НоваяЗапись.ВнешняяДатаОкончаниеПроизводства = КонецНедели(НоваяЗапись.ВнешняяДатаНачалоПроизводства + 7 * 24 * 3600 * НоваяЗапись.ВнешняяПродолжительностьПроизводства);		
			
			КонецЕсли;
			
			НужнаЗапись = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаЗапись Тогда
		
		НоваяЗапись.Комплект			= стПараметры.Комплект;
		НоваяЗапись.Период				= ТД;
		НоваяЗапись.Автор 				= ПараметрыСеанса.ТекущийПользователь;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
